[
  {
    "name": "Engineering I",
    "description": "Engineering is fundamental to the application of any scientific advancements - the methodological tools to facilitate the application of theory.",
    "prerequisites": [],
    "x": 0,
    "y": 0,
    "hardness": 10
  },
  {
    "name": "Engineering II",
    "description": "As immediate needs are met the real challenges can began to be addressed. Challenges of such difficulty and complexity that not analog in nature can even be drawn upon as a template for a solution.",
    "prerequisites": ["Engineering I"],
    "x": 150,
    "y": 0,
    "hardness": 10
  },
  {
    "name": "Computing I",
    "description": "Computing is essential to rocketry. The calculations for trajectory and orbital mechanics require the use of computers.",
    "prerequisites": [],
    "x": 0,
    "y": 100,
    "hardness": 10
  },
  {
    "name": "Computing II",
    "description": "The development of computers is a compounding effect. Better computers allow for improved software and more processing power to direct into the development of better computers.",
    "prerequisites": ["Computing I"],
    "x": 150,
    "y": 100,
    "hardness": 10
  },
  {
    "name": "Computing III",
    "description": "Saying computers have revolutionized everything is an understatement. At this point it would better be stated that they underpin everything.",
    "prerequisites": ["Computing II"],
    "x": 300,
    "y": 100,
    "hardness": 10
  },
  {
    "name": "Quantum Computing",
    "description": "The nature of quantum information is such that computing with it allows for computations that would be considered intractable on classical computers.",
    "prerequisites": ["Computing III"],
    "x": 450,
    "y": 100,
    "hardness": 10
  },
  {
    "name": "Rocketry I",
    "description": "By propelling reaction mass in one direction acceleration can be achieved. This is allows vehicles to maneuver despite having no atmosphere.",
    "prerequisites": [],
    "x": 0,
    "y": 200,
    "hardness": 10
  },
  {
    "name": "Rocketry II",
    "description": "The square-cube law. Volume increases by the cube of the size of the object whereas surface area increases by the square of the size of the object. Larger rockets leverage this to become more efficient.",
    "prerequisites": ["Rocketry I"],
    "x": 150,
    "y": 200,
    "hardness": 10
  },
  {
    "name": "Metallurgy",
    "description": "Rockets experience mechanical and thermal stresses, mastering production of materials able to handle these stresses is critical.",
    "prerequisites": [],
    "x": 0,
    "y": 400,
    "hardness": 10
  },
  {
    "name": "Materials I",
    "description": "More advanced materials help with every domain that uses them.",
    "prerequisites": ["Metallurgy"],
    "x": 150,
    "y": 400,
    "hardness": 10
  },
  {
    "name": "Materials II",
    "description": "By manufacturing materials that conform to strict molecular geometry properties once thought unachievable in materials are possible.",
    "prerequisites": ["Materials I"],
    "x": 300,
    "y": 400,
    "hardness": 10
  },
  {
    "name": "Orbital Infrastructure I",
    "description": "Despite the obvious downsides with orbital construction there are certain advantages. Many structural challenges that would be faced terrestrial structures can be ignored.",
    "prerequisites": ["Rocketry II"],
    "x": 300,
    "y": 300,
    "hardness": 10
  },
  {
    "name": "Orbital Infrastructure II",
    "description": "Construction of orbital infrastructure is a self reinforcing process. It becomes a logistical endeavor rather than an technological one. Organizing the vast army of orbital machinery to create structures unimaginable under the constraints of gravity.",
    "prerequisites": ["Orbital Infrastructure I"],
    "x": 450,
    "y": 300,
    "hardness": 10
  },
  {
    "name": "Fusion",
    "description": "Long hailed as a panacea of an energy rich future fusion releases immense energy by harnessing differences in per nucleon binding energies.",
    "prerequisites": ["Computing II", "Engineering II"],
    "x": 300,
    "y": 500,
    "hardness": 10
  },
  {
    "name": "Compact Fusion",
    "description": "Advancements in fusion technology have made it possible to produce fusion reactors capable of fitting on spacecraft. With this massive increase in availability of power things which once seemed untenable are now possible.",
    "prerequisites": ["Fusion"],
    "x": 450,
    "y": 500,
    "hardness": 10
  },
  {
    "name": "Aneutronic Fusion",
    "description": "While initially presenting increased engineering challenges aneutronic fusion has proved superior from a safety and simplicity perspective helping drive adoption of fusion reactors.",
    "prerequisites": ["Fusion"],
    "x": 600,
    "y": 600,
    "hardness": 10
  },
  {
    "name": "Nuclear Transmutation I",
    "description": "The ability to transmute matter into more desirable elements proves to be a great benefit to the industrial sector.",
    "prerequisites": ["Aneutronic Fusion"],
    "x": 600,
    "y": 700,
    "hardness": 10
  },
  {
    "name": "Nuclear Transmutation II",
    "description": "Using accelerators in orbit on a grand scale nuclear transmutation is now much more efficient.",
    "prerequisites": ["Nuclear Transmutation I", "Orbital Infrastructure II"],
    "x": 750,
    "y": 700,
    "hardness": 10
  },
  {
    "name": "Bioengineering I",
    "description": "Biology proves to be quite fragile. Technology can be used to help address shortcomings improving quality of life.",
    "prerequisites": [],
    "x": 150,
    "y": 700,
    "hardness": 10
  },
  {
    "name": "Bioengineering II",
    "description": "Going beyond just addressing shortcomings and immediate threats to life bioengineering offers potential for improvements over nature.",
    "prerequisites": ["Bioengineering I"],
    "x": 300,
    "y": 700,
    "hardness": 10
  }
]
